const filterPic = (name) => {
  switch (name) {
    case "Portrait":
      return {
        name: "Portrait",
        array: [120, 121, 122, 123, 124, 125, 126, 127, 128, 129],
        choice: 0,
        author: [
          "Альбрехт Дюрер",
          "Эль Греко",
          "Илья Репин",
          "Исаак Левитан",
          "Адольф Вильям Бугро",
          "Леонардо да Винчи",
          "Казимир Малевич",
          "Эль Греко",
          "Виктор Васнецов",
          "Константин Маковский",
        ],
      };
    case "Landscape":
      return {
        name: "Landscape",
        array: [130, 131, 132, 133, 134, 135, 136, 137, 138, 139],
        choice: 0,
        author: [
          "Эжен Делакруа",
          "Василий Поленов",
          "Анри Матисс",
          "Константин Маковский",
          "Пьер Огюст Ренуар",
          "Сандро Боттичелли",
          "Пьер Огюст Ренуар",
          "Гюстав Курбе",
          "Василий Поленов",
          "Константин Маковский",
        ],
      };
    case "Still Life":
      return {
        name: "Still Life",
        array: [140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
        choice: 0,
        author: [
          "Пьер Огюст Ренуар",
          "Иван Крамской",
          "Веласкес",
          "Илья Репин",
          "Рафаэль",
          "Александр Иванов",
          "Эдуард Мане",
          "Тициан",
          "Пьер Огюст Ренуар",
          "Карл Брюллов",
        ],
      };
    case "Graphic":
      return {
        name: "Graphic",
        array: [150, 151, 152, 153, 154, 155, 156, 157, 158, 159],
        choice: 0,
        author: [
          "Виктор Васнецов",
          "Питер Брейгель",
          "Виктор Васнецов",
          "Марк Шагал",
          "Леонардо да Винчи",
          "Франческо Баккьякка",
          "Жак-Луи Давид",
          "Альбрехт Дюрер",
          "Бартоломео Мурильо",
          "Василий Перов",
        ],
      };
    case "Antique":
      return {
        name: "Antique",
        array: [160, 161, 162, 163, 164, 165, 166, 167, 168, 169],
        choice: 0,
        author: [
          "Караваджо",
          "Франциско Гоя",
          "Рафаэль",
          "Михаил Врубель",
          "Винсент ван Гог",
          "Поль Деларош",
          "Джон Констебл",
          "Винсент ван Гог",
          "Франсуа Буше",
          "Рафаэль",
        ],
      };
    case "Avant-Garde":
      return {
        name: "Avant-Garde",
        array: [170, 171, 172, 173, 174, 175, 176, 177, 178, 179],
        choice: 0,
        author: [
          "Василий Тропинин",
          "Рембрандт",
          "Василий Суриков",
          "Исаак Левитан",
          "Архип Куинджи",
          "Веласкес",
          "Илья Репин",
          "Франсуа Буше",
          "Марианна Верёвкина",
          "Пьер Огюст Ренуар",
        ],
      };
    case "Renaissance":
      return {
        name: "Renaissance",
        array: [180, 181, 182, 183, 184, 185, 186, 187, 188, 189],
        choice: 0,
        author: [
          "Илья Репин",
          "Архип Куинджи",
          "Веласкес",
          "Николай Богданов-Бельский",
          "Иероним Босх",
          "Корреджо",
          "Питер Пауль Рубенс",
          "Жан Энгр",
          "Рафаэль",
          "Рембрандт",
        ],
      };
    case "Surrealistm":
      return {
        name: "Surrealistm",
        array: [190, 191, 192, 193, 194, 195, 196, 197, 198, 199],
        choice: 0,
        author: [
          "Питер Пауль Рубенс",
          "Архип Куинджи",
          "Эдгар Дега",
          "Алексей Венецианов",
          "Пьер Огюст Ренуар",
          "Рембрандт",
          "Эдуар Мане",
          "Никола Пуссен",
          "Питер Брейгель",
          "Виктор Васнецов",
        ],
      };
    case "Kitsch":
      return {
        name: "Kitsch",
        array: [200, 201, 202, 203, 204, 205, 206, 207, 208, 209],
        choice: 0,
        author: [
          "Сандро Боттичелли",
          "Леонардо да Винчи",
          "Аксели Галлен-Каллела",
          "Винсент Ван Гог",
          "Клод Моне",
          "Рембрандт",
          "Караваджо",
          "Иван Айвазовский",
          "Винсент Ван Гог",
          "Аксели Галлен-Каллела",
        ],
      };
    case "Minimalist":
      return {
        name: "Minimalist",
        array: [210, 211, 212, 213, 214, 215, 216, 217, 218, 219],
        choice: 0,
        author: [
          "Ян Вермеер",
          "Питер Пауль Рубенс",
          "Клод Моне",
          "Жан Фрагонар",
          "Марианна Верёвкина",
          "Винсент Ван Гог",
          "Клод Моне",
          "Иван Айвазовский",
          "Ян Вермеер",
          "Карл Брюллов",
        ],
      };
    case "Avangard":
      return {
        name: "Avangard",
        array: [220, 221, 222, 223, 224, 225, 226, 227, 228, 229],
        choice: 0,
        author: [
          "Питер Брейгель",
          "Поль Гоген",
          "Иван Шишкин",
          "Клод Моне",
          "Рафаэль",
          "Пабло Пикассо",
          "Эдгар Дега",
          "Николай Рерих",
          "Илья Репин",
          "Клод Моне",
        ],
      };
    default:
      return {
        name: "Industrial",
        array: [230, 231, 232, 233, 234, 235, 236, 237, 238, 239],
        choice: 0,
        author: [
          "Исаак Левитан",
          "Иван Айвазовский",
          "Эдгар Дега",
          "Николай Рерих",
          "Леонардо да Винчи",
          "Эль Греко",
          "Пабло Пикассо",
          "Аксели Галлен-Каллела",
          "Иван Айвазовский",
          "Эжен Делакруа",
        ],
      };
  }
};

export default filterPic;
