import "./css/scss/style.scss";
import "./js/main";
/* import "./js/category"; */
import "./js/music/play-music";

/* import "./js/cardRender/artist"; */
/* "eslint --fix src/index.js" */

console.log(`
Настройки не работают, отыгрывает только музыка.
1. Cтартовая страница
Есть кнопки, при которых открываются два типа вопросов +20
При переходе на вопрос викторы есть возможность вернутся назад
Нет кнопки на категориях викторины чтобы вернутся назад +5

2. Настройки их нет (не работают), кроме стандартного звука на раунды +5
3.Страница категорий +20  Карточи отличаются и отображают результат прохождения раунда
4. Страница с вопросами +50 Вроде всё есть
5. Страницы результатов нет +0
Есть плавная смена, но она не всегда работает плавно. Иногда картинки слишком долго грузятся +5
Доп.функционала сложной анимации нет.
Итого: 105
Пичаль`);
